## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.firewall-cinema.google_compute_firewall.rules["allow-http-ingress"] has changed
!   resource "google_compute_firewall" "rules" {
        id                      = "projects/terrateam-362405/global/firewalls/allow-http-ingress"
        name                    = "allow-http-ingress"
+       source_service_accounts = []
+       source_tags             = []
+       target_service_accounts = []
+       target_tags             = []
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # helm_release.istio-base will be created
+   resource "helm_release" "istio-base" {
+       atomic                     = false
+       chart                      = "istio-base"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-base"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "v1.15.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istio-d will be created
+   resource "helm_release" "istio-d" {
+       atomic                     = false
+       chart                      = "istiod"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istiod"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.nginx-ingress-chart will be created
+   resource "helm_release" "nginx-ingress-chart" {
+       atomic                     = false
+       chart                      = "nginx-ingress-controller"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "nginx-ingress-controller"
+       namespace                  = "default"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.bitnami.com/bitnami"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "9.3.11"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.nginx_ingress_chart will be destroyed
  # (because helm_release.nginx_ingress_chart is not in configuration)
-   resource "helm_release" "nginx_ingress_chart" {
-       atomic                     = false -> null
-       chart                      = "nginx-ingress-controller" -> null
-       cleanup_on_fail            = false -> null
-       create_namespace           = false -> null
-       dependency_update          = false -> null
-       disable_crd_hooks          = false -> null
-       disable_openapi_validation = false -> null
-       disable_webhooks           = false -> null
-       force_update               = false -> null
-       id                         = "nginx-ingress-controller" -> null
-       lint                       = false -> null
-       max_history                = 0 -> null
-       metadata                   = [
-           {
-               app_version = "1.3.1"
-               chart       = "nginx-ingress-controller"
-               name        = "nginx-ingress-controller"
-               namespace   = "default"
-               revision    = 1
-               values      = "null"
-               version     = "9.3.11"
            },
        ] -> null
-       name                       = "nginx-ingress-controller" -> null
-       namespace                  = "default" -> null
-       pass_credentials           = false -> null
-       recreate_pods              = false -> null
-       render_subchart_notes      = true -> null
-       replace                    = false -> null
-       repository                 = "https://charts.bitnami.com/bitnami" -> null
-       reset_values               = false -> null
-       reuse_values               = false -> null
-       skip_crds                  = false -> null
-       status                     = "deployed" -> null
-       timeout                    = 300 -> null
-       verify                     = false -> null
-       version                    = "9.3.11" -> null
-       wait                       = true -> null
-       wait_for_jobs              = false -> null
    }

  # kubernetes_namespace.istio-system will be created
+   resource "kubernetes_namespace" "istio-system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
